{"/about/":{"data":{"":"","#":"$ whoami\nProfessional I have a BS in Systems Engineering and have worked from incredibly awesome start-ups to the formal mighty financial industry, on hands-on, pure, unadulterated web and full-stack application development.\nFor some time now, I’ve been working with Salesforce (Apex/LWC development), and have to say I never expected that I was going to enjoy Java as much as I am, working on my double star ranger rank on Salesforce’s trailhead.\nI am currently employed working as an Application Development Tech Lead at a financial advisory firm in Camas, WA. USA.\nPersonal I love to code. I learnt Python around 2000, and alongside HTML5+ and JavaScript technologies it became my passion. I’ve also been a Linux user for decades, and feel more at home writing Open Source software.\nI also tutor coding (Check learncoding.rocks) for HS kids, college students and adult folks.\nContact I don’t participate much in social media currently, I’d very much like building, rather than consuming technology, especialy mainstream type. But in any case, I sometimes lurk around on BlueSky and Reddit."},"title":"About Rustix"},"/posts/":{"data":{"":" I’ve been developing software (hands-on) since 1985, professionally since 1996, and I firmly believe after all these years, that there cannot be software development without some other hobby to keep us sane, I took up woodworking and have dabbled in it for several years now"},"title":"Tech"},"/posts/dumb-ai/":{"data":{"":"Seriously, is AI helping in any way other than being an annoying collection of smart (debatable) decision collections???\nCoding speaking, Copilot, Agentforce, etc, are, to me, like an annoying child that though smart, wants to embed his crap in everything you’re doing, yes, sometimes is is useful, specially when you want to include some boilerplate code, or want to illustrate a fibonacci algorithm, or a non-recursive factorial method in python, and so on.\nBut some of us work on real applications with real business requirements and no amount of AI will make our code work the way we really wanted, don’t even get me started with code completion, it is utter crap, seriously, I think the AI marketing plot is one created by semi-technical idiots that hate real developers, in order to piss us off and give (non-technical) management a reason to explain their exploded licensing budget for AI.\nFirst thing I do in VS Code (my default IDE) is to disable these mostrosities and regain a bit of sanity.\nSure, “.. Hey, ChatGPT, create a one page summary of the importance of the wrath of Achilles from the Illiad poem ..”, or “.. Hey OpenAI, resume the 3-hour audio file from my professor (from the class I missed) into a bulletpoint paragraph ..”, that kind of thing, but please, stay away from coding."},"title":"Dumb AI"},"/posts/fancy-menu/":{"data":{"":"","#":"Let’s Eat Pâté of roasted indigenous legumes, paired with a compote of seasonal berries?, Anyone?\nI live in Camas Washington, a suburb of Vancouver WA, which in itself would be considered a suburb or Portland OR, Camas is beautiful indeed, and wouldn’t live anywhere else, but Camas is not Bordeaux, or Dijon, yet some restaurants seem to disagree with me.\nI would not consider myself cheap per se, but when you start seeing words like “Deconstructed”, “Foraged”, “Aioli”, “fresh cracked pepper”, “buttermilk-soaked”, etc. - On an otherwise quaint little town’s downtown restaurants, then you get the picture.. it becomes a bit annoying.\nTake for example, this Menu item:\nPâté of roasted indigenous legumes, paired with a compote of seasonal berries, served on hearty sprouted wheat bread.\nYou realize that the above just means Peanut Butter and Jelly Sandwich.\nSo why the pompous name then, well, a PBJS will set you back, say 3 bucks, whereas our hearty wheat bread option can ring up to 6, or 7 dollars a piece, a nice 100%+ markup for fancy words, sacré Bleu!!.\nUp-selling in the restaurant industry is a huge industry in and on itself, and apparently it works, it just doesn’t for me.\nSo in the spirit of giving to all folkspeople like me a gift, I present you with with my amazing “Fancy Menu Generator”, so if/when you decide to open your own restaurant in downtown, get your menu ready, and slap on it an outrageous price on the items (suggested price included), you can’t go wrong, here it is:\nShow me the menu Generate New Menu | Clear Menu\nDa Code Code was implemented as an IIFE for simplicity, it is pure Javascript without any external dependencies, all you need to do is create a \u003cdiv id=\"fancy-menu\"\u003e\u003c/div\u003e wrapper html element and call it from a link or button with a similar structure:\n\u003ca href=\"javascript:void(0)\" title=\"Generate Menu\" onclick=\"FancyMenu.show();\"\u003eGenerate Menu\u003c/a\u003e let FancyMenu = (() =\u003e { let _generate = {}, show, clear, getPriceInt, chooseOneOf, nouns = [ 'Infusion', 'Suggestion', 'Memory', 'Whisper', 'Cloud', 'Distillation', 'Essence', 'Deconstruction', 'Cream', 'Suppression', 'Ragu', 'Purée', 'Foam', 'Blade', 'Carpaccio', 'Dumpling', 'Velouté', 'Raviolli', 'Compote', 'Emulsion', 'Palette', 'Curd', 'Bricolage', 'Casserole'], cook_method = [ 'Water-Bathed', 'Broiled', 'Flame-Roasted', 'Blackened', 'Braised', 'fondant', 'Liquidised', 'Nitro-Poached', 'Jellied', 'Hand-Carved', 'Shaved', 'Josper-Baked', 'Kiln-Smoked', 'Hashed', 'Salt-Crusted', 'Macerated', 'Flattened', 'Bain-marie', 'Ionized', 'Pickled', 'Maple-Cured'], trendy = [ 'Woodcock', 'Sea Scallops', 'Calf\\'s Liver', 'John Dory', 'Sweetbread', 'Langoustines', 'Black Pudding', 'Squab Pigeon', 'Monkfish', 'Aĩoli Hancock', 'Black Bream', 'Chorizo', 'Quail', 'Barramundi', 'Octopus', 'Bone Marrow', 'Duck Breast', 'Pig\\'s Trotter', 'Sea Bass', 'Serrano Ham'], serve_method = [ 'floated', 'draped', 'bubbled', 'reasting', 'heaped', 'layered', 'combined ', 'served', 'entwined', 'on a bed', 'spliced', 'tossed', 'plated with', 'enrobed by', 'accompanied', 'injected', 'presented', 'laced', 'arranged', 'nested', 'Chiffonade'], prepositions = ['on', 'over', 'with', 'in', 'by', 'through', 'within'], upsale = [ 'unique', 'hand', 'locally-sourced', 'perennial', 'chef\\'s choice', 'decomposed', '', 'triple-basted', 'seasonal', 'arabesque', 'spanish', 'mediterranean', 'locally-inspired', 'hollistically assembled', 'a dash of', 'slow roasted'], prep_method = [ 'Mashed', 'Diced', 'Sliced', 'Cubed', 'Pan-Fried', 'Crushed', 'Provenčal', 'Wafered', 'Sauteed', 'Artisan', 'Slop-Poached', 'Responsibly Sourced', 'Griddled', 'Marinated', 'Boiled', 'Aromatic', 'Buttered', 'Two-Way', 'Herbed', 'Heritage'], side = [ 'Baby Turnips', 'Cabbage', 'Potato', 'Tomato Bed', 'Chervil', 'Aubergine', 'Courgette', 'Beetroot', 'Spring Onion', 'Radishes', 'Asparragus', 'Black Olives', 'Celeriac', 'Herbs de Provence', 'Purple Sprouting Broccoli', 'Chard', 'Chicory', 'Semphire', 'Mung Beans', 'Fennel', 'Watercress']; chooseOneOf = (arrSize) =\u003e { return Math.floor(Math.random() * arrSize); }; _generate = (numItems) =\u003e { numItems = typeof (numItems) === 'number' ? numItems : 5; let items = []; for (let i = 0; i \u003c numItems; i++) { items.push( nouns[chooseOneOf(nouns.length)] + ' of ' + cook_method[chooseOneOf(cook_method.length)] + ' ' + trendy[chooseOneOf(trendy.length)] + ' ' + serve_method[chooseOneOf(serve_method.length)] + ' ' + prepositions[chooseOneOf(prepositions.length)] + ' ' + upsale[chooseOneOf(upsale.length)] + ' ' + prep_method[chooseOneOf(prep_method.length)] + ' ' + side[chooseOneOf(side.length)] + ', $' + getPriceInt().toString() + '.95'); } return items; }; show = (menuItems) =\u003e { clear(); let items = _generate(typeof menuItems === 'number' ? menuItems : 10); let fancyMenuContainer = document.getElementById('fancy-menu'); fancyMenuContainer.insertAdjacentHTML('beforeend', '\u003col\u003e'); items.forEach(function (item) { fancyMenuContainer.insertAdjacentHTML('beforeend', '\u003cli\u003e' + item + '\u003c/li\u003e'); }); fancyMenuContainer.insertAdjacentHTML('beforeend', '\u003c/ol\u003e'); }; clear = () =\u003e { document.getElementById('fancy-menu').innerHTML = ''; }; getPriceInt = () =\u003e { /* Returns a value for a fancy menu item */ let min = Math.ceil(17), max = Math.floor(26); return Math.floor(Math.random() * (max - min) + min); } return { show: show, clear: clear }; })(); "},"title":"Fancy Restaurant Menu"},"/rustix/":{"data":{"":" "},"title":"Woodworking"},"/rustix/about-rustix-cabins/":{"data":{"":"I build (and sell) custom log miniature cabins.\nI have a collection of different cabin “models” in which I build different types of miniature cabins, using the “butt \u0026 pass” build design, using only locally sourced spruce.\nRoofs are painted using water-based stains and they are detachable.\nCabins can be lit using fairy lights, button LED candles or other non-flammable technologies."},"title":"About Rustix Cabins"},"/rustix/small-showcase/":{"data":{"":"Some of my cabin work.\nImportant to mention tha I am not, by any means, an expert, or claim to be one, but have done several cool projects that I think they’re worth sharing, I am also planning to add discussions to the posts.\nSome of the stuff that I’ll be showcasing on my Rustix Woodworking series:"},"title":"Showcase Cabins"}}