{"/about/":{"data":{"":"","#":"$ whoami\nProfessional I have a BS in Systems Engineering and have worked from incredibly awesome start-ups to the formal mighty financial industry, on hands-on, pure, unadulterated web and full-stack application development.\nFor some time now, I’ve been working with Salesforce (Apex/LWC development), and have to say I never expected that I was going to enjoy Java as much as I am, working on my double star ranger rank on Salesforce’s trailhead.\nI am currently employed working as an Application Development Tech Lead at a financial advisory firm in Camas, WA. USA.\nPersonal I love to code. I learnt Python around 2000, and alongside HTML5+ and JavaScript technologies it became my passion. I’ve also been a Linux user for decades, and feel more at home writing Open Source software.\nI also tutor coding (Check learncoding.rocks) for HS kids, college students and adult folks.\nContact I don’t participate much in social media currently, I’d very much like building, rather than consuming technology, especialy mainstream type. But in any case, I sometimes lurk around on BlueSky and Reddit."},"title":"About Rustix"},"/posts/":{"data":{"":" I’ve been developing software (hands-on) since 1985, professionally since 1996, and I firmly believe after all these years, that there cannot be software development without some other hobby to keep us sane, I took up woodworking and have dabbled in it for several years now"},"title":"Tech"},"/posts/fancy-menu/":{"data":{"":"Pâté of roasted indigenous legumes, paired with a compote of seasonal berries?, Anyone?\nI live in Camas Washington, a suburb of Vancouver WA, which in itself would be considered a suburb or Portland OR, Camas is beautiful indeed, and wouldn’t live anywhere else, but Camas is not Bordeaux, or Dijon, yet some restaurants seem to disagree with me.\nI would not consider myself cheap per se, but when you start seeing words like “Deconstructed”, “Foraged”, “Aioli”, “fresh cracked pepper”, “buttermilk-soaked”, etc. - On an otherwise quaint little town’s downtown restaurants, then you get the picture.. it becomes a bit annoying.\nTake for example, this Menu item:\nPâté of roasted indigenous legumes, paired with a compote of seasonal berries, served on hearty sprouted wheat bread.\nYou realize that the above just means Peanut Butter and Jelly Sandwich.\nSo why the pompous name then, well, a PBJS will set you back, say 3 bucks, whereas our hearty wheat bread option can ring up to 6, or 7 dollars a piece, a nice 100%+ markup for fancy words, sacré Bleu!!.\nUp-selling in the restaurant industry is a huge industry in and on itself, and apparently it works, it just doesn’t for me.\nSo in the spirit of giving to all folkspeople like me a gift, I present you with with my amazing “Fancy Menu Generator”, so if/when you decide to open your own restaurant in downtown, get your menu ready, and slap on it an outrageous price on the items (suggested price included), you can’t go wrong, here it is:\nHello"},"title":"Fancy Restaurant Menu"},"/rustix/":{"data":{"":" "},"title":"Woodworking"},"/rustix/about-rustix-cabins/":{"data":{"":"I build (and sell) custom log miniature cabins.\nI have a collection of different cabin “models” in which I build different types of miniature cabins, using the “butt \u0026 pass” build design, using only locally sourced spruce.\nRoofs are painted using water-based stains and they are detachable.\nCabins can be lit using fairy lights, button LED candles or other non-flammable technologies."},"title":"About Rustix Cabins"},"/rustix/small-showcase/":{"data":{"":"Some of my cabin work.\nImportant to mention tha I am not, by any means, an expert, or claim to be one, but have done several cool projects that I think they’re worth sharing, I am also planning to add discussions to the posts.\nSome of the stuff that I’ll be showcasing on my Rustix Woodworking series:"},"title":"Showcase Cabins"}}